_posts/2013-08-24-upcoming-talks-in-2013.html
---
layout: post
title: Upcoming Talks in 2013
---

<p class="meta">24 August 2013 - San Francisco</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Upcoming Talks in 2013</h2>
<div class="outline-text-2" id="text-1">
<p>
This is the year I teach myself to become a better public speaker. I've spent the past year coding up a number of powerful <a href="http://sritchie.github.io/projects/">Scala and Clojure projects</a>, all the while avoiding the important and difficult work of teaching and writing about the import and use of those projects. Well, no longer.
</p>

<p>
To mind that gap I'll be giving a number of talks in 2013 on my recent work on Summingbird and Cascalog. If you're in the Bay Area, Boston, or Northern VA (my home town!), I'd love to meet you.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Introduction to Summingbird (Sept 3rd, Bay Area Storm Users)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="http://twitter.com/posco">Oscar Boykin</a> and I will be giving an Introduction to Summingbird at the Bay Area Storm Users meetup on Tuesday, September 3rd. Summingbird is a streaming MapReduce framework we developed at Twitter that allows you to write a streaming computation once and execute it in batch-mode on Scalding, in realtime mode on Storm, or on both Scalding and Storm in a hybrid batch/realtime mode that has very attractive fault tolerance properties. Sound exciting? RSVP at the event's <a href="http://www.meetup.com/Bay-Area-Storm-Users/events/135403842/">meetup page</a>.
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Realtime MapReduce at Twitter (Sept 22nd, CUFP)</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Check this one out at the <a href="http://cufp.org/conference/sessions/2013/sam-ritchie-twitter-inc-realtime-mapreduce-twitter">Commercial Users of Functional Programming</a> conference, September 22nd-24th in Boston. This talk will focus more on the functional programming ideas we used in the design of Summingbird's real-time MapReduce DSL and its component libraries (<a href="https://github.com/twitter/storehaus">Storehaus</a>, <a href="https://github.com/twitter/bijection">Bijection</a>, and <a href="https://github.com/twitter/algebird">Algebird</a>). Which ideas helped our design? What hurt?
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Summingbird, Scala and Storm (Sept 25th, Boston Storm Users)</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Another Introduction to Summingbird talk, with a focus on how Scala's type system and style helps us write correct Storm topologies. Register at the Boston Storm Users' <a href="http://www.meetup.com/Boston-Storm-Users/events/135630522/">meetup page</a>.
</p>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Twitter: Taking Hadoop Realtime with Summingbird (Oct 19th, PNWScala)</h3>
<div class="outline-text-3" id="text-1-4">
<p>
This talk at the <a href="http://pnwscala.org/">Pacific Northwest Scala Conference</a> will get into the guts of Summingbird's batch/realtime merging abstraction and the streaming MapReduce graph planner we've developed. Here's the abstract:
</p>

<blockquote>
<p>
Twitter's Summingbird library allows developers and data scientists to build massive streaming MapReduce pipelines without worrying about the usual mess of systems issues that come with realtime systems at scale. This talk will discuss the development of Summingbird's hybrid Batch and Realtime operating mode, the power of clean, mathematical abstractions and the massive creative leverage that functional design constraints can give to a project.
</p>

<p>
The talk will also discuss some of the applications for these technologies currently being used at Twitter.
</p>
</blockquote>

<p>
Registration is filling up fast, so <a href="https://pnwscala2013.eventbrite.com/?ref=elink">sign up today!</a>
</p>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Streaming MapReduce in Clojure (Nov 14-16, Clojure/Conj)</h3>
<div class="outline-text-3" id="text-1-5">
<p>
This talk will discuss my work on <a href="https://groups.google.com/forum/#!topic/cascalog-user/F8EkFM7HiE0">Cascalog 2</a> and its new "execution platform" abstraction. The recent Cascalog 2 redesign split the datalog compiler apart from the underlying Cascading functions that get called when you run a Cascalog query on a MapReduce cluster. With luck, by the time I deliver the talk, Cascalog will be able to run on <a href="https://github.com/nathanmarz/storm/wiki/Trident-tutorial">Trident</a> and <a href="https://github.com/mesos/spark">Spark</a>.
</p>

<p>
I'll be delivering this talk in my hometown of Alexandria, VA at this year's <a href="http://clojure-conj.org/">Clojure/Conj</a>.
</p>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">So You Want to Build a MapReduce DSL? (Jan 11th, Data Day Texas, Austin TX)</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Still working on the meat of this one, but some initial thoughts - I'd like discuss the vast number of choices in the MapReduce DSL world. Spark, Scoobi, Summingbird, Scalding&#x2026; folks are writing Hadoop DSLs in Ruby, in Mathematica, in Clojure. Where does it end? What's the right level of abstraction? This talk will discuss why so many different options exist and some pitfalls to beware of when choosing between them.
</p>

<p>
More information on Data Day Texas, including registration info, on the <a href="http://datadaytexas.com/">event page</a>.
</p>
</div>
</div>
</div>
